In [1]:
people = {
    "first" : ["Jane", "John", "Tommy"],
    "last" : ["doe", "doe", "White"],
    "email" : ["janedoe@gmail.com", "johndoe@gmail.com", "tommy@yahoo.com"]
}

In [2]:
people['first']

['Jane', 'John', 'Tommy']

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [6]:
df[['first', 'email']]

   first              email
0   Jane  janedoe@gmail.com
1   John  johndoe@gmail.com
2  Tommy    tommy@yahoo.com

In [7]:
type(df['email'])

pandas.core.series.Series

In [8]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [9]:
df.iloc[[0, 1]]

  first last              email
0  Jane  doe  janedoe@gmail.com
1  John  doe  johndoe@gmail.com

In [10]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [11]:
df.loc[[0, 1], ['first', 'email']]

  first              email
0  Jane  janedoe@gmail.com
1  John  johndoe@gmail.com

In [12]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [13]:
df['last'] == "doe"

0     True
1     True
2    False
Name: last, dtype: bool

In [14]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [15]:
filt = (df['last'] == 'doe') & (df['first'] == 'Jane') # filter | Print email's that are equal to ... 
my_filter = (df['last'] == 'White') & (df['first'] == 'Tommy')

In [16]:
df[filt] # print the data frame of "filt"
df.loc[my_filter, ['last', 'first']]

    last  first
2  White  Tommy

In [17]:
df.loc[filt, ['last', 'email']] # print the data frame of "filt" by location .

  last              email
0  doe  janedoe@gmail.com

In [18]:
tommy = df.loc[my_filter, ['first', 'last']]

In [19]:
tommy

   first   last
2  Tommy  White

In [20]:
filt = (df['last'] != 'doe') & (df['first'] != 'Jane')

In [21]:
df[~filt]

  first last              email
0  Jane  doe  janedoe@gmail.com
1  John  doe  johndoe@gmail.com

In [22]:
df['email'] = df['email'].str.lower()

In [23]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [24]:
df['email'].apply(len)

0    17
1    17
2    15
Name: email, dtype: int64

In [25]:
df['email'].apply(lambda x: x.lower())

0    janedoe@gmail.com
1    johndoe@gmail.com
2      tommy@yahoo.com
Name: email, dtype: object

In [26]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [27]:
df

   first   last              email
0   Jane    doe  janedoe@gmail.com
1   John    doe  johndoe@gmail.com
2  Tommy  White    tommy@yahoo.com

In [28]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [29]:
len(df['email'])

3

In [30]:
df.apply(lambda x: x.max())

first              Tommy
last                 doe
email    tommy@yahoo.com
dtype: object

In [31]:
df.applymap(len)

   first  last  email
0      4     3     17
1      4     3     17
2      5     5     15

In [32]:
df = df.applymap(lambda x: x.lower())

In [33]:
df

   first   last              email
0   jane    doe  janedoe@gmail.com
1   john    doe  johndoe@gmail.com
2  tommy  white    tommy@yahoo.com